package study;

public class study_data_structure {

	
//자료구조는 , 프로그램에서 사용할 많은 데이터를 메모리상에서 관리하는 여러 구현 방법들
	
	
	//선형 자료 구조 : 한 줄로 자료를 관리하기
	
	//배열 array : 정해진 크기의 메모리를 먼저 할당 받아 사용하고 , 자료의 물리적 위치와 논리적 위치가 같다.
	
	
	//연결 리스트 linkedList : 선형으로 자료를 관리하며, 자료가 추가 될때마다 할당 받고 자료는 링크로 연결된다
	// 자료의 물리적 위치와 논리적 위치가 다를 수 있다.
	
	
	//스택
	//가장 나중에 입력 된 자료가 가장먼저 출력되는 자료구조 ( Last in First Out) LIFO
	//push와 pop 으로 표
	
	
	//큐 
	//가장 먼저 입력 된 자료가 가장 먼저 출력되는 자료구조 ( First in First Out) FIFO
	//맨앞을 front , 맨 뒤를 rear ,  추가를 enqueue라고 한다.
	//삭제를 dequeue라고 한다.
	
	
	//트리
	//부모 노드와 자식 노드간의 연결로 이루어진 자료구조
	
	
	//이진 트리 
	//부모 노드에 자식 노드가 두개 이하인 트리(left child node , right child node)
	
	//이진 탐색 트리
	//찾으려는 값이 부모노드 값보다 작으면 left child 로  , 크면 right child로 
	//그래서 값의 중복을 허용하지 않는다.
	
	
	//해싱
	//자료를 검색하기 위한 자료구조
	//key는 유일하고 이에 대한 value를 쌍으로 저장한다.
	
	
	
	
}
